#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: kouxi08, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113601662332]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113601662331]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113601662341]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113601662340]
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113601662342]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113601662339]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113601662330]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113601662348]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113601662338]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113601662346]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113601662352]
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113600510456]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113601662349]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113601662344]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113601662354]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113601662353]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113601662351]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113601662333]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113601662334]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113601662336]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113601662350]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113601662345]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113601662347]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113601662337]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113601662395]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113601662387]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113601662360]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113601662361]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113601662362]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113601662363]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113601662368]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113601662364]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113601662367]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113601662365]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113601662366]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113601662355]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=19732]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601662354" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113601662387" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601662344" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113601662360" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601662351" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113601662395" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                   = "113601662337" -> (known after apply)
        name                 = "k8s-dev-router-1"
      ~ server_id            = "113601662355" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601662333" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113601662364" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601662345" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113601662363" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601662353" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113601662365" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601662334" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113601662367" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601662347" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113601662362" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601662350" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113601662366" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601662349" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113601662368" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601662336" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113601662361" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601662354",
        ] -> (known after apply)
        id                = "113601662387"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601662344",
        ] -> (known after apply)
        id                = "113601662360"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601662351",
        ] -> (known after apply)
        id                = "113601662395"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks             = [
          - "113601662337",
        ] -> (known after apply)
        id                = "113601662355"
        name              = "k8s-dev-router-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601662333",
          - "113601662352",
        ] -> (known after apply)
        id                = "113601662364"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601662345",
          - "113601662339",
        ] -> (known after apply)
        id                = "113601662363"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601662353",
          - "113601662340",
        ] -> (known after apply)
        id                = "113601662365"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601662334",
          - "113601662341",
        ] -> (known after apply)
        id                = "113601662367"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601662347",
          - "113601662342",
        ] -> (known after apply)
        id                = "113601662362"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601662350",
          - "113601662346",
        ] -> (known after apply)
        id                = "113601662366"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601662349",
          - "113601662338",
        ] -> (known after apply)
        id                = "113601662368"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601662336",
          - "113601662348",
        ] -> (known after apply)
        id                = "113601662361"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 12 to add, 12 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>